app/controllers/api/v1/languages_controller.rb

SELECT "languages".* FROM "languages"
---
    def index
        @languages = Language.all.map{|l| {key: l.id, value: l.name, text: l.name}}