app/controllers/api/v1/projects_controller.rb

INSERT INTO "projects" ("user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["description", "I have the best idea ever"], ["created_at", "2019-09-24 20:11:11.704622"], ["updated_at", "2019-09-24 20:11:11.704622"]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
SELECT "languages".* FROM "languages" INNER JOIN "project_languages" ON "languages"."id" = "project_languages"."language_id" WHERE "project_languages"."project_id" = $1  [["project_id", 97]]
INSERT INTO "languages" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "SQL"], ["created_at", "2019-09-25 15:27:39.399619"], ["updated_at", "2019-09-25 15:27:39.399619"]]
INSERT INTO "project_languages" ("project_id", "language_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 96], ["language_id", 33], ["created_at", "2019-09-25 15:27:39.414796"], ["updated_at", "2019-09-25 15:27:39.414796"]]
---
    def create
        @project = @user.projects.create(project_params)
        params[:selected].each{|language| @project.languages.create(name: language) }

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]
INSERT INTO "images" ("src", "project_id") VALUES ($1, $2) RETURNING "id"  [["src", ""], ["project_id", 96]]
---
      def add_img
        @project = Project.find(params[:project_id])
        @project.images.create(src: params[:src])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "priority", "due_date", "project_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Set up database"], ["priority", ""], ["due_date", "2019-09-25"], ["project_id", 105]]
---
      def add_task
        @project = Project.find(params[:project_id])
        @project.tasks.create(name: params[:name], due_date: params[:due_date], priority: params[:priority])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
UPDATE "projects" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["name", "Movie Recommender"], ["description", "Cool "], ["updated_at", "2019-09-30 23:39:18.533569"], ["id", 105]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 108]]
DELETE FROM "project_languages" WHERE "project_languages"."id" = $1  [["id", 41]]
SELECT "languages".* FROM "languages" INNER JOIN "project_languages" ON "languages"."id" = "project_languages"."language_id" WHERE "project_languages"."project_id" = $1  [["project_id", 105]]
INSERT INTO "languages" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "C"], ["created_at", "2019-09-30 23:35:19.019982"], ["updated_at", "2019-09-30 23:35:19.019982"]]
INSERT INTO "project_languages" ("project_id", "language_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 105], ["language_id", 69], ["created_at", "2019-09-30 23:35:19.022857"], ["updated_at", "2019-09-30 23:35:19.022857"]]
---
      def update
        @project = Project.find(params[:project_id])
        @project.update(project_params)
        @project.languages.destroy_all
        if params[:languages]
         params[:languages].each{|language| @project.languages.create(name: language) }