app/controllers/api/v1/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "tasks" SET "is_complete" = $1 WHERE "tasks"."id" = $2  [["is_complete", true], ["id", 47]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 105]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
---
    def update
        @task = Task.find(params[:id])
        @task.update(task_params)
        @project = Project.find(@task.project_id)